## Plan for aws/lambda
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 1 to change, 14 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_cloudfront_distribution.api`                               |
|        | `aws_cloudfront_response_headers_policy.security_headers_api`   |
|        | `aws_lambda_function_url.api`                                   |
|        | `module.api.aws_cloudwatch_log_group.this`                      |
|        | `module.api.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.api.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.api.aws_iam_policy.policies[0]`                         |
|        | `module.api.aws_iam_role.this`                                  |
|        | `module.api.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.api.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.api.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.api.aws_lambda_function.this`                           |
| delete | `aws_api_gateway_account.api_cloudwatch`                        |
|        | `aws_api_gateway_base_path_mapping.rest-api`                    |
|        | `aws_api_gateway_deployment.rest-api`                           |
|        | `aws_api_gateway_domain_name.rest-api`                          |
|        | `aws_api_gateway_method_settings.settings[&quot;dev&quot;]`               |
|        | `aws_api_gateway_method_settings.settings[&quot;prod&quot;]`              |
|        | `aws_api_gateway_rest_api.rest-api`                             |
|        | `aws_api_gateway_stage.rest-api`                                |
|        | `aws_cloudwatch_log_group.api_gateway_log_group`                |
|        | `aws_iam_role.api_cloudwatch`                                   |
|        | `aws_iam_role_policy.lambda-iam-role-policy`                    |
|        | `aws_iam_role_policy_attachment.api_cloudwatch`                 |
|        | `aws_lambda_function.api_handler`                               |
|        | `aws_lambda_permission.rest-api-invoke`                         |
| update | `aws_lambda_function.lambda-warmer`                             |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/secret/actions/runs/7619603894).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be destroyed
  - resource "aws_api_gateway_account" "api_cloudwatch" {
      - api_key_version     = "4" -> null
      - cloudwatch_role_arn = "arn:aws:iam::637287734259:role/ApiGatewayCloudWatchRole" -> null
      - features            = [
          - "UsagePlans",
        ] -> null
      - id                  = "api-gateway-account" -> null
      - throttle_settings   = [
          - {
              - burst_limit = 5000
              - rate_limit  = 10000
            },
        ] -> null
    }

  # aws_api_gateway_base_path_mapping.rest-api will be destroyed
  - resource "aws_api_gateway_base_path_mapping" "rest-api" {
      - api_id      = "7s14db9pfd" -> null
      - domain_name = "encrypted-message.cdssandbox.xyz" -> null
      - id          = "encrypted-message.cdssandbox.xyz/" -> null
      - stage_name  = "prod" -> null
    }

  # aws_api_gateway_deployment.rest-api will be destroyed
  - resource "aws_api_gateway_deployment" "rest-api" {
      - created_date      = "2021-01-04T20:10:58Z" -> null
      - execution_arn     = "arn:aws:execute-api:ca-central-1:637287734259:7s14db9pfd/dev" -> null
      - id                = "rp9nfq" -> null
      - invoke_url        = "https://7s14db9pfd.execute-api.ca-central-1.amazonaws.com/dev" -> null
      - rest_api_id       = "7s14db9pfd" -> null
      - stage_description = "59f13bb4b0a606f4bec33cb8a38384d0" -> null
      - stage_name        = "dev" -> null
    }

  # aws_api_gateway_domain_name.rest-api will be destroyed
  - resource "aws_api_gateway_domain_name" "rest-api" {
      - arn                     = "arn:aws:apigateway:ca-central-1::/domainnames/encrypted-message.cdssandbox.xyz" -> null
      - certificate_arn         = "arn:aws:acm:us-east-1:637287734259:certificate/24f38821-07f1-4f2e-a9cb-a946ea86a6b6" -> null
      - certificate_upload_date = "2023-04-12T17:31:35Z" -> null
      - cloudfront_domain_name  = "d1m43pxr7aba6b.cloudfront.net" -> null
      - cloudfront_zone_id      = "Z2FDTNDATAQYW2" -> null
      - domain_name             = "encrypted-message.cdssandbox.xyz" -> null
      - id                      = "encrypted-message.cdssandbox.xyz" -> null
      - security_policy         = "TLS_1_2" -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null

      - endpoint_configuration {
          - types = [
              - "EDGE",
            ] -> null
        }
    }

  # aws_api_gateway_method_settings.settings["dev"] will be destroyed
  - resource "aws_api_gateway_method_settings" "settings" {
      - id          = "7s14db9pfd-dev-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "7s14db9pfd" -> null
      - stage_name  = "dev" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "ERROR" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = 5000 -> null
          - throttling_rate_limit                      = 10000 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # aws_api_gateway_method_settings.settings["prod"] will be destroyed
  - resource "aws_api_gateway_method_settings" "settings" {
      - id          = "7s14db9pfd-prod-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "7s14db9pfd" -> null
      - stage_name  = "prod" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "ERROR" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = 5000 -> null
          - throttling_rate_limit                      = 10000 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # aws_api_gateway_rest_api.rest-api will be destroyed
  - resource "aws_api_gateway_rest_api" "rest-api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:ca-central-1::/restapis/7s14db9pfd" -> null
      - binary_media_types           = [
          - "application/octet-stream",
          - "application/x-tar",
          - "application/zip",
          - "audio/basic",
          - "audio/ogg",
          - "audio/mp4",
          - "audio/mpeg",
          - "audio/wav",
          - "audio/webm",
          - "image/png",
          - "image/jpg",
          - "image/jpeg",
          - "image/gif",
          - "video/ogg",
          - "video/mpeg",
          - "video/webm",
        ] -> null
      - body                         = jsonencode(
            {
              - definitions                            = {
                  - Empty = {
                      - title = "Empty Schema"
                      - type  = "object"
                    }
                }
              - info                                   = {
                  - title   = "secret"
                  - version = "1.0"
                }
              - paths                                  = {
                  - /                 = {
                      - get = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /decrypt/{id}     = {
                      - get = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - parameters                      = [
                              - {
                                  - in       = "path"
                                  - name     = "id"
                                  - required = true
                                  - type     = "string"
                                },
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /delete/{id}      = {
                      - delete = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - parameters                      = [
                              - {
                                  - in       = "path"
                                  - name     = "id"
                                  - required = true
                                  - type     = "string"
                                },
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /encrypt          = {
                      - post = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /ping             = {
                      - get = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /slack            = {
                      - post = {
                          - consumes                        = [
                              - "application/x-www-form-urlencoded",
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /{lang}           = {
                      - get = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - parameters                      = [
                              - {
                                  - in       = "path"
                                  - name     = "lang"
                                  - required = true
                                  - type     = "string"
                                },
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                  - /{lang}/view/{id} = {
                      - get = {
                          - consumes                        = [
                              - "application/json",
                            ]
                          - parameters                      = [
                              - {
                                  - in       = "path"
                                  - name     = "lang"
                                  - required = true
                                  - type     = "string"
                                },
                              - {
                                  - in       = "path"
                                  - name     = "id"
                                  - required = true
                                  - type     = "string"
                                },
                            ]
                          - produces                        = [
                              - "application/json",
                            ]
                          - responses                       = {
                              - 200 = {
                                  - description = "200 response"
                                  - schema      = {
                                      - $ref = "#/definitions/Empty"
                                    }
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
                            }
                        }
                    }
                }
              - schemes                                = [
                  - "https",
                ]
              - swagger                                = "2.0"
              - x-amazon-apigateway-binary-media-types = [
                  - "application/octet-stream",
                  - "application/x-tar",
                  - "application/zip",
                  - "audio/basic",
                  - "audio/ogg",
                  - "audio/mp4",
                  - "audio/mpeg",
                  - "audio/wav",
                  - "audio/webm",
                  - "image/png",
                  - "image/jpg",
                  - "image/jpeg",
                  - "image/gif",
                  - "video/ogg",
                  - "video/mpeg",
                  - "video/webm",
                ]
            }
        ) -> null
      - created_date                 = "2020-12-20T23:11:07Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:ca-central-1:637287734259:7s14db9pfd" -> null
      - id                           = "7s14db9pfd" -> null
      - name                         = "secret-production-rest-api" -> null
      - root_resource_id             = "3be70xfgag" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_api_gateway_stage.rest-api will be destroyed
  - resource "aws_api_gateway_stage" "rest-api" {
      - arn                   = "arn:aws:apigateway:ca-central-1::/restapis/7s14db9pfd/stages/prod" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "rp9nfq" -> null
      - execution_arn         = "arn:aws:execute-api:ca-central-1:637287734259:7s14db9pfd/prod" -> null
      - id                    = "ags-7s14db9pfd-prod" -> null
      - invoke_url            = "https://7s14db9pfd.execute-api.ca-central-1.amazonaws.com/prod" -> null
      - rest_api_id           = "7s14db9pfd" -> null
      - stage_name            = "prod" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = true -> null
    }

  # aws_cloudfront_distribution.api will be created
  + resource "aws_cloudfront_distribution" "api" {
      + aliases                         = [
          + "encrypted-message.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "secret"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "secret"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 86400
          + max_ttl                    = 31536000
          + min_ttl                    = 1
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "secret-production-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/version"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "secret-production-api"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "secret-production-api"

          + custom_header {
              + name  = "X-CloudFront-Header"
              + value = "secret-production-api"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:637287734259:certificate/24f38821-07f1-4f2e-a9cb-a946ea86a6b6"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "api-cloudfront-headers"

      + security_headers_config {

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "same-origin"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be destroyed
  - resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
      - arn               = "arn:aws:logs:ca-central-1:637287734259:log-group:api_gateway_log_group" -> null
      - id                = "api_gateway_log_group" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "api_gateway_log_group" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "secret-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "secret-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_iam_role.api_cloudwatch will be destroyed
  - resource "aws_iam_role" "api_cloudwatch" {
      - arn                 ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.dynamodb-table"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda-iam-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.key"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.lambda-warmer"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
